-- MySQL dump 10.13  Distrib 8.0.34, for Win64 (x86_64)
--
-- Host: localhost    Database: chemicallab
-- ------------------------------------------------------
-- Server version	8.0.34

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `projects`
--

DROP TABLE IF EXISTS `projects`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `projects` (
  `ID_проекту` int NOT NULL AUTO_INCREMENT,
  `Назва_проекту` varchar(255) DEFAULT NULL,
  `Опис_проекту` text,
  `Відповідальний_співробітник` int DEFAULT NULL,
  `Дата_початку_проекту` date DEFAULT NULL,
  `Термін_завершення_проекту` date DEFAULT NULL,
  PRIMARY KEY (`ID_проекту`),
  KEY `Відповідальний_співробітник` (`Відповідальний_співробітник`),
  CONSTRAINT `projects_ibfk_1` FOREIGN KEY (`Відповідальний_співробітник`) REFERENCES `employees` (`ID_співробітника`)
) ENGINE=InnoDB AUTO_INCREMENT=31 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `projects`
--

LOCK TABLES `projects` WRITE;
/*!40000 ALTER TABLE `projects` DISABLE KEYS */;
INSERT INTO `projects` VALUES (1,'Дослідження нового каталізатора','Розробка та тестування нового каталізатора для хімічного процесу',1,'2027-02-01','2028-01-31'),(2,'Впровадження екологічних технологій','Впровадження нових технологій для зменшення негативного впливу на довкілля',3,'2027-03-15','2028-03-14'),(3,'Оптимізація виробничих процесів','Аналіз та оптимізація хімічних виробничих процесів',2,'2027-04-01','2027-10-01'),(4,'Розробка нової формули полімеру','Створення нового полімеру з покращеними властивостями',4,'2027-05-01','2028-04-30'),(5,'Вдосконалення методів аналізу','Впровадження нових методів аналізу хімічних речовин та продуктів',5,'2027-06-15','2028-06-14'),(6,'Стабілізація процесу виробництва','Розробка системи стабілізації виробничого процесу',1,'2027-07-01','2028-06-30'),(7,'Дослідження нових матеріалів','Аналіз та тестування нових хімічних матеріалів',3,'2027-08-15','2028-08-14'),(8,'Впровадження автоматизації','Впровадження автоматизованих систем у виробництво',12,'2027-09-01','2028-09-30'),(9,'Розробка безпечних реакцій','Створення безпечних хімічних реакцій та технологій',7,'2027-10-15','2028-10-14'),(10,'Покращення контролю якості','Оптимізація та покращення системи контролю якості',5,'2027-11-01','2028-11-30'),(11,'Вдосконалення технології очищення води','Дослідження та впровадження нових методів очищення води',18,'2028-01-01','2029-01-01'),(12,'Розробка нових кольорових пігментів','Створення і тестування нових кольорових пігментів для фарб та покриттів',2,'2028-02-01','2029-02-28'),(13,'Виробництво енергоефективних каталізаторів','Створення та виробництво каталізаторів для енергоефективних процесів',3,'2028-03-01','2029-03-31'),(14,'Екологічно чисті пестициди','Дослідження та створення нових екологічно чистих пестицидів для захисту врожаю',4,'2028-04-01','2029-04-30'),(15,'Розробка нового клейоного засобу','Створення клейоного засобу з покращеними характеристиками',5,'2028-05-01','2029-05-31'),(16,'Біотехнології виробництва біопалива','Дослідження та впровадження біотехнологій для виробництва біопалива',17,'2028-06-01','2029-06-30'),(17,'Ефективні системи очищення повітря','Розробка та впровадження систем очищення повітря для промислових потреб',23,'2028-07-01','2029-07-31'),(18,'Створення нового виду полімеру','Дослідження та виробництво нового полімеру з унікальними властивостями',31,'2028-08-01','2029-08-31'),(19,'Оптимізація хімічного виробництва','Аналіз та оптимізація хімічного виробництва для підвищення ефективності',14,'2028-09-01','2029-09-30'),(20,'Розробка нових матеріалів для медицини','Створення матеріалів з покращеними властивостями для медичних застосувань',5,'2028-10-01','2029-10-31'),(21,'Розробка нових фарб для автомобілів','Створення нових фарб з покращеними властивостями для автомобілів',11,'2029-01-01','2030-01-01'),(22,'Впровадження відновлюваної енергії','Розробка та впровадження систем відновлюваної енергії',12,'2029-02-01','2030-02-28'),(23,'Синтез нових лікарських речовин','Дослідження та створення нових лікарських речовин для фармацевтичної промисловості',13,'2029-03-01','2030-03-31'),(24,'Біотехнології виробництва їжі','Розробка та впровадження біотехнологій для виробництва здорової їжі',14,'2029-04-01','2030-04-30'),(25,'Створення нового виду батарей','Дослідження та виробництво нового покоління батарей для різних пристроїв',15,'2029-05-01','2030-05-31'),(26,'Розробка безпеки автоматизованих систем','Створення та впровадження систем безпеки для автоматизованих технологічних процесів',11,'2029-06-01','2030-06-30'),(27,'Екологічно чисті матеріали для упаковки','Дослідження та виробництво екологічно чистих матеріалів для упаковки',12,'2029-07-01','2030-07-31'),(28,'Розробка нового виду пластиків','Створення пластикових матеріалів з покращеними властивостями',23,'2029-08-01','2030-08-31'),(29,'Оптимізація виробництва лікарських препаратів','Аналіз та оптимізація процесів виробництва лікарських препаратів',14,'2029-09-01','2030-09-30'),(30,'Розробка нових методів дистрибуції','Створення ефективних методів дистрибуції продукції на ринок',15,'2029-10-01','2030-10-31');
/*!40000 ALTER TABLE `projects` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-12-27 11:10:29
