-- MySQL dump 10.13  Distrib 8.0.34, for Win64 (x86_64)
--
-- Host: localhost    Database: chemicallab
-- ------------------------------------------------------
-- Server version	8.0.34

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `employees`
--

DROP TABLE IF EXISTS `employees`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `employees` (
  `ID_співробітника` int NOT NULL AUTO_INCREMENT,
  `Ім_я` varchar(50) DEFAULT NULL,
  `Прізвище` varchar(50) DEFAULT NULL,
  `Посада` varchar(100) DEFAULT NULL,
  `Навички` varchar(255) DEFAULT NULL,
  `Контактна_інформація` varchar(255) DEFAULT NULL,
  `Дата_прийому_на_роботу` date DEFAULT NULL,
  `Зарплата` decimal(10,2) DEFAULT NULL,
  PRIMARY KEY (`ID_співробітника`)
) ENGINE=InnoDB AUTO_INCREMENT=46 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `employees`
--

LOCK TABLES `employees` WRITE;
/*!40000 ALTER TABLE `employees` DISABLE KEYS */;
INSERT INTO `employees` VALUES (1,'Іван','Петров','Лаборант','Хімічний аналіз, Лабораторні техніки','ivan.petrov@example.com','2023-01-15',35000.00),(2,'Марія','Іванова','Інженер-хімік','Хімічний синтез, Апаратне обладнання','maria.ivanova@example.com','2023-02-01',45000.00),(3,'Петро','Сидоров','Дослідник','Хімічна аналітика, Дослідження реакцій','petro.sidorov@example.com','2023-03-10',50000.00),(4,'Олена','Федорова','Технік-лаборант','Підготовка зразків, Апаратні методи','olena.fedorova@example.com','2023-04-15',30000.00),(5,'Андрій','Ковальчук','Хімік-аналітик','Хімічний аналіз, Хроматографія','andriy.kovalchuk@example.com','2023-05-20',40000.00),(6,'Тетяна','Семенова','Інженер-хімік','Хімічний синтез, Аналіз сировини','tetiana.semenova@example.com','2023-06-01',42000.00),(7,'Олег','Мельник','Дослідник','Експериментальна хімія, Аналіз даних','oleg.melnyk@example.com','2023-07-15',48000.00),(8,'Наталя','Павленко','Технік-лаборант','Підготовка розчинів, Спектроскопія','natalia.pavlenko@example.com','2023-08-01',32000.00),(9,'Сергій','Григоренко','Хімік-аналітик','Аналітична хімія, Хроматографія','sergiy.grigorenko@example.com','2023-09-15',42000.00),(10,'Катерина','Лисенко','Інженер-хімік','Хімічний синтез, Експериментальна хімія','katerina.lisenko@example.com','2023-10-01',45000.00),(11,'Євген','Шевченко','Дослідник','Хімічна технологія, Дослідження реакцій','yevgen.shevchenko@example.com','2023-11-15',50000.00),(12,'Анастасія','Гончаренко','Технік-лаборант','Підготовка зразків, Спектроскопія','anastasiya.goncharenko@example.com','2023-12-01',33000.00),(13,'Дмитро','Кузьменко','Хімік-аналітик','Аналітична хімія, Хроматографія','dmytro.kuzmenko@example.com','2024-01-15',42000.00),(14,'Оксана','Романова','Інженер-хімік','Хімічний синтез, Експериментальна хімія','oksana.romanova@example.com','2024-02-01',46000.00),(15,'Віталій','Коваленко','Дослідник','Хімічна технологія, Дослідження реакцій','vitaliy.kovalenko@example.com','2024-03-10',52000.00),(16,'Артас','Менетіл','Інженер-хімік','Хімічний синтез, Апаратне обладнання','artas.menetil@example.com','2025-02-01',48000.00),(17,'Йордан','Стрідер','Технік-лаборант','Підготовка зразків, Спектроскопія','jordan.strider@example.com','2025-03-10',33000.00),(18,'Сильвана','Вітрушка','Хімік-аналітик','Аналітична хімія, Хроматографія','sylvana.windrusher@example.com','2025-04-15',42000.00),(19,'Тралл','Мартоніс','Інженер-хімік','Хімічний синтез, Експериментальна хімія','thrall.martonis@example.com','2025-05-20',46000.00),(20,'Гульдан','Сквернослов','Дослідник','Хімічна технологія, Дослідження реакцій','guldan.foulmouth@example.com','2025-06-01',52000.00),(21,'Жайна','Прадмур','Технік-лаборант','Підготовка розчинів, Спектроскопія','jaina.proudmoore@example.com','2025-07-15',33000.00),(22,'Артур','Дейнеріс','Хімік-аналітик','Аналітична хімія, Хроматографія','arthas.deineris@example.com','2025-08-01',42000.00),(23,'Волджин','Демонік','Інженер-хімік','Хімічний синтез, Експериментальна хімія','voljin.demonic@example.com','2025-09-15',46000.00),(24,'Сильвана','Стрікер','Дослідник','Хімічна технологія, Дослідження реакцій','sylvanas.striker@example.com','2025-10-01',52000.00),(25,'Рексар','Тотембері','Технік-лаборант','Підготовка зразків, Спектроскопія','rexar.totemberi@example.com','2025-11-15',33000.00),(26,'Девайл','Бладсінгер','Інженер-хімік','Хімічний синтез, Апаратне обладнання','devail.bladesinger@example.com','2026-02-01',48000.00),(27,'Ліна','Інверзе','Технік-лаборант','Підготовка зразків, Спектроскопія','lina.inverse@example.com','2026-03-10',33000.00),(28,'Зевс','Тандем','Хімік-аналітик','Аналітична хімія, Хроматографія','zeus.tandem@example.com','2026-04-15',42000.00),(29,'Крістальмаїд','Глейс','Інженер-хімік','Хімічний синтез, Експериментальна хімія','crystalmaiden.glaice@example.com','2026-05-20',46000.00),(30,'Трент','Протектор','Дослідник','Хімічна технологія, Дослідження реакцій','treant.protector@example.com','2026-06-01',52000.00),(31,'Лесрак','Торнстом','Технік-лаборант','Підготовка розчинів, Спектроскопія','leshrac.tornstrom@example.com','2026-07-15',33000.00),(32,'Рубік','Алет','Хімік-аналітик','Аналітична хімія, Хроматографія','rubick.allet@example.com','2026-08-01',42000.00),(33,'Тролль','Уорден','Інженер-хімік','Хімічний синтез, Експериментальна хімія','troll.warlock@example.com','2026-09-15',46000.00),(34,'Віспер','Гейб','Дослідник','Хімічна технологія, Дослідження реакцій','wisp.gabe@example.com','2026-10-01',52000.00),(35,'Дарк Віллоу','Шріксінгер','Технік-лаборант','Підготовка зразків, Спектроскопія','darkwillow.shrixinger@example.com','2026-11-15',33000.00),(36,'Джагернаут','Омніс','Інженер-хімік','Хімічний синтез, Апаратне обладнання','juggernaut.omnis@example.com','2027-02-01',48000.00),(37,'Міракл','Медуза','Технік-лаборант','Підготовка зразків, Спектроскопія','miracle.medusa@example.com','2027-03-10',33000.00),(38,'Інвокер','Сентінел','Хімік-аналітик','Аналітична хімія, Хроматографія','invoker.sentinel@example.com','2027-04-15',42000.00),(39,'Ліона','Абаддон','Інженер-хімік','Хімічний синтез, Експериментальна хімія','lion.abaddon@example.com','2027-05-20',46000.00),(40,'Тінь Шаман','Шакал','Дослідник','Хімічна технологія, Дослідження реакцій','shadowshaman.jackal@example.com','2027-06-01',52000.00),(41,'Сларк','Спектр','Технік-лаборант','Підготовка розчинів, Спектроскопія','slark.spectre@example.com','2027-07-15',33000.00),(42,'Техіс','Каррі','Хімік-аналітик','Аналітична хімія, Хроматографія','techies.carry@example.com','2027-08-01',42000.00),(43,'Мірана','Девайті','Інженер-хімік','Хімічний синтез, Експериментальна хімія','mirana.deity@example.com','2027-09-15',46000.00),(44,'Пудж','Метаморф','Дослідник','Хімічна технологія, Дослідження реакцій','pudge.metamorph@example.com','2027-10-01',52000.00),(45,'Інвізібл','Райдер','Технік-лаборант','Підготовка зразків, Спектроскопія','invisible.rider@example.com','2027-11-15',33000.00);
/*!40000 ALTER TABLE `employees` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-12-27 11:10:29
